[
  {
     "imageid":"001",
     "cordinates":[
        "19.804722",
        "85.818333"
     ],
     "name":"Shri Jagannath Temple/Shree Mandir (Puri)",
     "country":"India",
     "state":"Odisha",
     "district":"Puri",
     "description":"The temple was built by the Ganga dynasty king Anantavarman Chodaganga in the 12th century CE, as suggested by the Kendupatna copper-plate inscription of his descendant Narasimhadeva II. Anantavarman was originally a Shaivite, and became a Vaishnavite sometime after he conquered the Utkala region (in which the temple is located) in 1112 CE.  A 1134–1135 CE inscription records his donation to the temple. Therefore, the temple construction must have started sometime after 1112 CE. According to a story in the temple chronicles, it was founded by Anangabhima-deva II:  different chronicles variously mention the year of construction as 1196, 1197, 1205, 1216, or 1226. This suggests that the temple's construction was completed or that the temple was renovated during the reign of Anantavarman's son Anangabhima. The temple complex was further developed during the reigns of the subsequent kings, including those of the Ganga dynasty and the Suryvamshi (Gajapati) dynasty.",
     "wikilink":"https://en.wikipedia.org/wiki/Jagannath_Temple,_Puri",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Shri_Jagannatha_Temple.jpg/1024px-Shri_Jagannatha_Temple.jpg"
  },
  {
     "imageid":"002",
     "cordinates":[
        "19.8875",
        "86.094722"
     ],
     "name":"Konark/The Sun Temple(Puri)",
     "country":"India",
     "state":"Odisha",
     "district":"Puri",
     "description":"1559, Mukunda Gajapati came to throne in Cuttack. He aligned himself as an ally of Akbar and an enemy of the Sultan of Bengal, Sulaiman Khan Karrani. After a few battles, Odisha finally fell. The fall was also aided by the internal turmoil of the state. In 1568, the Konark temple was damaged by the army of Kalapahad, a general of the Sultan.[12] Kalapahad is also said to be responsible for damages to several other temples during the conquest.",
     "wikilink":"https://en.wikipedia.org/wiki/Konark",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Sun_Temple_Main_Structure%2C_Konark%2C_Orissa.jpg/800px-Sun_Temple_Main_Structure%2C_Konark%2C_Orissa.jpg"
  },
  {
     "imageid":"003",
     "cordinates":[
        "19.999917",
        "86.194794"
     ],
     "name":"Maa Mangala Temple(Kakatpur)",
     "country":"India",
     "state":"Odisha",
     "district":"Puri",
     "description":"There is no written prove based on the evolution of the Deity. The legend behind the evolution has no base in ancient days. The myth is that before Odisha(Utkala) had a good commercial relationship with different island like singhala, java sumatra etc. Demon Ravana was worshiping goddess Mangala with his great devotion and became the most powerful by the blessing of Deity. After the victory of Lord Ram, goddess was taken to odisha from singhala by an sadhaba pua (one who do business with other country & islands) .At that time the Prachi civilization was getting civilized and developed more day by day & was only path to enter Utkala.That,s why he established the Deity Mangala in Prachi valley.But the above legend has no written prove this is only oral prove by local people. So that this thesis has become a myth not a fact.So this can't be acceptable has the goddess was taken from Sri Lanka to Odisha.If we have look to the culture & curving style of Odisha & compare to curving style of goddess no doubt curving style is Utkaliyas.",
     "wikilink":"https://en.wikipedia.org/wiki/Maa_Mangala_Temple,_Kakatpur",
     "image":"https://upload.wikimedia.org/wikipedia/commons/0/0c/Maa_Mangala.jpg"
  },
  {
     "imageid":"004",
     "cordinates":[
        "19.920493",
        "85.818156"
     ],
     "name":"Baba Lokanatha Temple(Puri)",
     "country":"India",
     "state":"Odisha",
     "district":"Puri",
     "description":"Puri Lokanatha Temple is a Hindu Temple situated in the town of Puri, Odisha, India. It is dedicated to Lord Shiva. According to history the lingam in this temple was established by Lord Rama. The unique feature is that the Shivalinga is always under water which substantiates the legend that Goddess Ganga flows through the top of the shivalinga as a stream. The festival that is celebrated with great fervor and pomp is the Saranti Somavar Fair while devotees believe that the shivalinga has powers to cure diseases after seeking the darshan of Lord Shiva. The utsava murti of Lokanatha is kept inside the Jagannath temple, Puri. He is the guardian deity of all the treasures and jewellery of Lord Jagannath. This temple is one of the five famous Shiva temple of Puri. Others are Markandeswara Temple, Jambeswar Temple, Banambara Temple and Kapalamochana Temple.",
     "wikilink":"https://en.wikipedia.org/wiki/Lokanatha_Temple",
     "image":"http://puripolice.nic.in/sites/default/files/misc/images/Lokanatha_Temple2.jpg"
  },
  {
     "imageid":"005",
     "cordinates":[
        "20.238333",
        "85.833611"
     ],
     "name":"Baba Lingaraja Temple(Bhubaneswar)",
     "country":"India",
     "state":"Odisha",
     "district":"Khordha,Bhubaneswar",
     "description":"Lingaraja, literally means the king of Lingam, the iconic form of Shiva. Shiva was originally worshipped as Kirtivasa and later as Harihara and is commonly referred to as Tribhuvaneshwara (also called Bhubaneswar), the master of three worlds, namely, heaven, earth, and netherworld. His consort is called Bhuvaneshvari.",
     "wikilink":"https://en.wikipedia.org/wiki/Lingaraja_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Lingaraj_Temple_in_the_evening.jpg/1024px-Lingaraj_Temple_in_the_evening.jpg"
  },
  {
     "imageid":"006",
     "cordinates":[
        "20.477244",
        "85.862564"
     ],
     "name":"Maa Chandi Temple(Cuttack)",
     "country":"India",
     "state":"Odisha",
     "district":"Cuttack",
     "description":"Late Sri Hansa Panda started worshiping the Deity with utmost Niti, Nistha, and Sraddha. As per the scriptures related to Goddess Chandika or Bhuvaneshwari has four hands, showing weapons and gestures as Paasa, Ankusha, Abhaya, Varada. She is worshipped as Bhuvaneswari while chanting Bhuvaneswari Mantra. After Late Sri Hansa Panda, his only son Late Sri Lakshmana Panda started worshipping The Goddess in the same process and procedure. He was blessed with four daughters, named Champa, Tulasi, Mali and Malati. Those daughters were also helping their father Late Sri Lakshmana Panda, in the rituals (Seva Puja) of the Deity. Late Lakshmana panda always prayed Maa Chandi to have a son and after praying so many days, he was blessed with a son, named Sri Dayanidhi Panda, who also followed the footprint of his predecessors. The temple came to lime light during Sri Dayanidhi Panda. Number of devotees increased during his period. He has six sons, who are presently performing rituals (seva puja) of deity. They are namely Sri Narayan Panda, Sri Narahari Panda, Sri Somnath Panda, Sri Chakradhar Panda, Sri Loknath Panda and Sri Ratnakar Panda. The above hereditary sevaks along with their fourteen sons are presently performing the Seva Puja (Rituals) in the Temple. The fourteen sons are Jagabandhu, Dinabandhu, Bikram, Gopal, Sarat Kumar, Sukhadeva, Bhagadeba, Manoj, Trilochan, Susant, Biswaranjan, Ramachandra, Pramod, Ranjit. It was established in the year 1946.",
     "wikilink":"https://en.wikipedia.org/wiki/Cuttack_Chandi_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Katak_Chandi_temple.jpg/800px-Katak_Chandi_temple.jpg"
  },
  {
     "imageid":"007",
     "cordinates":[
        "20.833764",
        "86.338144"
     ],
     "name":"Maa Biraja Temple(Jajpur)",
     "country":"India",
     "state":"Odisha",
     "district":"Jajpur",
     "description":"The Biraja Temple, or Birija Kshetra , is a historic Hindu temple located in Jajpur (about 125 kilometres (78 mi) north of Bhubaneswar), Odisha, India. The present temple was built during the 13th century. The principal idol is Devi Durga, who is worshiped as Viraja (Girija), and the temple gave Jajpur the nicknames Viraja Kshetra and Biraja Peetha. The Durga idol has two hands (dwibhuja), spearing the chest of Mahishasura with one hand and pulling his tail with the other. One of her feet is on a lion, and the other is on Mahishasura's chest. Mahishasura is depicted as a water buffalo. The idol's crown features Ganesha, a crescent moon and a lingam. The temple covers a large area, and has several shrines to Shiva and other deities. According to the Skanda Purana it cleanses pilgrims, and it is called the Viraja or the Biraja kshetra. Jajpur is believed to have about one crore of Shiva lingams.",
     "wikilink":"https://en.wikipedia.org/wiki/Biraja_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/a/a5/Biraja_Temple%2C_Jajpur%2C_Odisha%2C_India%2C_13th_century.jpg"
  },
  {
     "imageid":"008",
     "cordinates":[
        "19.920493",
        "85.818156"
     ],
     "name":"Jay Baladevjew Temple(Kendrapara)",
     "country":"India",
     "state":"Odisha",
     "district":"Kendrapara",
     "description":"The present shrine of Siddha Baladeva Jew was constructed during the Maratha rule in Odisha (1761 AD) of Ichhapur (Kendrapara). It was constructed by the king of Kujanga, Raja Gopal Sandha and Zamindar (landlord) of Chhedara killah, Srinivas Narendra Mahapatra. One saint (Santha) Gopi Das and Sairatak Giri convinced the then Maratha Chief Janoji and constructed the Jagamohan, Bhoga Mandapa of the main temple, temple of Gundicha and compound wall. It is believed that Khan-I-Duran, the subedar of Odisha during the Mughal Emperor Aurangzeb demolished the temple in 1661 and built a mosque on the remains of the temple. Devotees of Lord Baladev Jeu, took the deity in disguise in a boat through the river Govari and kept the deity in a secret place near Baranga (Chhedara) Jungle. Afterwards it was shifted to Balarampur village near Luna river at Sakhi Bata. Later it was transferred to the present day Icchapur temple.",
     "wikilink":"https://en.wikipedia.org/wiki/Baladevjew_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Baladevjew_Temple%2C_Ichhapur%2C_Kendrapara_district%2C_Odisha..JPG/800px-Baladevjew_Temple%2C_Ichhapur%2C_Kendrapara_district%2C_Odisha..JPG"
  },
  {
     "imageid":"009",
     "cordinates":[
        "21.383333",
        "85.883333"
     ],
     "name":"Maa Tarini Temple(Ghatgaon)",
     "country":"India",
     "state":"Odisha",
     "district":"Kendujhar",
     "description":"It is said by the local people that King of Kendujhar was bringing Tarini Maa from puri to Kendujhar with a condition that if he turn back then she'll not move further. The King was riding a horse and Goddess was following him to Kendujhar. King could know that Maa Tarini was coming behind from the sound of her ornaments but near the ghatagaon in the deep forest the sound of the ornaments didn't came and the king looked back thinking that she's not coming. But Maa Tarini was coming and due to the forest mud her ornaments sounds was not coming. Due to the condition Maa tarini stayed there and worshiped as the queen of Forest.",
     "wikilink":"https://en.wikipedia.org/wiki/Maa_Tarini_Temple,_Ghatgaon",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Tarni_temple_Gate_view.JPG/800px-Tarni_temple_Gate_view.JPG"
  },
  {
     "imageid":"010",
     "cordinates":[
        "20.811756",
        "86.655237"
     ],
     "name":"Baba Akhandalamani Temple(Bhadrak)",
     "country":"India",
     "state":"Odisha",
     "district":"Bhadrak",
     "description":"There is no conclusive history available either regarding Baba Akhandalamani or the temple of the lord Siva. According to legend, around 350 years ago during the rule of Raja Sri Niladri Samara Singha Mohapatra, one early morning the Raja sent a peasant to cultivate his paddy field on the bank of the river Baitarani. While cultivating, the blade of his plough was broken by hitting with some hard material. The peasant was astonished and found a black glazed granite stone full of blood flowing toward the river Baitarani. The peasant ran to call King Niladrisamar Singhm and he hurriedly came to the spot, finding a flood of milk in place of blood and a huge black cobra hooding the stone. That night the king had a dream regarding the arrival of the God Akhandalamani on that place. This news spread like wild fire in the locality. The next day King Niladri Samara Singha Mohapatra started worshiping the great god and immediately built a wooden temple on the spot. A large number of devotees from different villages started visiting and worshiping the great God. The king invited five Brahmins from a village named Naharagrama of Jajapur district to perform seva-puja (worshiping and taking care) of lord Akhandalamani. The present main temple of Aradi was built by the King of Konika Shri Harihara Bhanja and his chief queen Satyabhama Patadei. The height of the temple is around 150 ft. All the stones used in this temple were brought from the historic hill of Lalitgiri near Chandikhol.",
     "wikilink":"https://en.wikipedia.org/wiki/Akhandalamani_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/e/ed/Akhandalamani_Mandir.jpg"
  },
  {
     "imageid":"011",
     "cordinates":[
        "21.537722",
        "86.879453"
     ],
     "name":"Khirachora Gopinatha Temple",
     "country":"India",
     "state":"Odisha",
     "district":"Baleswar",
     "description":"Over 500 years ago Madhavendra Puri was going to Puri to get some sandalwood for his Sri Gopal deity in Vrindavana. After a few days in Navadvipa, Sri Puri started for Odisha. Within a few days he arrived at Remuna where Gopinatha is situated. Seeing the beauty of the Deity, Madhavendra Puri was overwhelmed. In the corridor of the temple, from which people generally viewed the Deity, Madhavendra Puri chanted and danced. Then he sat down there and asked a brahmana what kinds of foods they offered to the Deity. Madhavendra Puri thought: I shall inquire from the priest what foods are offered to Gopinatha so that by making arrangements in our kitchen, we can also offer similar foods to Sri Gopala.When the Brahman priest was questioned in this matter, he explained in detail the types of food that were offered to the Deity of Gopinatha. The brahmana priest said: In the evening the Deity is offered sweet rice in twelve earthen pots. Because the taste is as good as nectar, it is named amrta keli. This sweet rice is celebrated throughout the world as gopinatha-kheer. It is not offered anywhere else in the world. While Madhavendra Puri was talking with the brahmana priest, the sweet rice was placed before the Deity as an offering. Seeing this Madhavendra Puri thought If, without my asking, a little sweet rice is given to me, I could then taste it and make a similar preparation to offer my Lord Gopala. Then immediately Madhavendra Puri realised his mistake in desiring to taste the sweet rice, and he immediately repented, I have committed an offence. I have desired to taste the preparation before it was offered to the Lord.Thinking in this way Puri Gosvami left and went to a nearby vacant marketplace. Sitting there he began to chant. After finishing the worship to Gopinatha the Pujari (priest) rested. In a dream Gopinath told him to get up and take the pot of khira that he had hidden under his garments and to give it to Madhavendra Puri. The Pujari got up, found the sweet, and brought it to Madhavendra Puri. The Pujari told him For you Sri Gopinatha has stolen khira. There is no other fortunate man like you. This is how the deity got the name Khira Chora Gopinatha. Khira means milk, and Chora means thief.",
     "wikilink":"https://en.wikipedia.org/wiki/Khirachora_Gopinatha_Temple",
     "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Khirachora_Gopinatha_Temple.jpg/800px-Khirachora_Gopinatha_Temple.jpg"
  }
]